In [1]:
import pandas as pd
from typing import List

/opt/conda/lib/python3.9/site-packages/pandas/core/computation/expressions.py:21: UserWarning: Pandas requires version '2.8.4' or newer of 'numexpr' (version '2.8.0' currently installed).
  from pandas.core.computation.check import NUMEXPR_INSTALLED
/opt/conda/lib/python3.9/site-packages/pandas/core/arrays/masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.4' currently installed).
  from pandas.core import (

In [2]:
pd.read_excel('./participants.xlsx')

   user_id   name  age  country  score continent
0     1001   Mark   55    Italy    4.5    Europe
1     1000   John   33      USA    6.7   America
2     1002    Tim   41      USA    3.9   America
3     1003  Jenny   12  Germany    9.0    Europe

In [16]:
# create a DataFrame from scratch
data: List[list] = [['Mark', 55, 'Italy', 4.5, 'Europe'],
                    ['John', 33, 'USA', 6.7, 'America'],
                    ['Tim', 41, 'USA', 3.9, 'America'],
                    ['Jenny', 12, 'Germany', 9.0, 'Europe']]

df: pd.DataFrame = pd.DataFrame(data=data,
                                columns=['name', 'age', 'country', 'score', 'continent'],
                                index=[1001, 1000, 1002, 1003])

df

       name  age  country  score continent
1001   Mark   55    Italy    4.5    Europe
1000   John   33      USA    6.7   America
1002    Tim   41      USA    3.9   America
1003  Jenny   12  Germany    9.0    Europe

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 1001 to 1003
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       4 non-null      object
 1   age        4 non-null      int64
 2   country    4 non-null      object
 3   score      4 non-null      float64
 4   continent  4 non-null      object
dtypes: float64(1), int64(1), object(3)
memory usage: 192.0+ bytes

# Index

In [18]:
df.index

Index([1001, 1000, 1002, 1003], dtype='int64')

In [19]:
df.index.name = 'user_id'
df

          name  age  country  score continent
user_id
1001      Mark   55    Italy    4.5    Europe
1000      John   33      USA    6.7   America
1002       Tim   41      USA    3.9   America
1003     Jenny   12  Germany    9.0    Europe

## "reset_index" turns the index into a column, replacing the index with the default index.

In [20]:
df.reset_index()

   user_id   name  age  country  score continent
0     1001   Mark   55    Italy    4.5    Europe
1     1000   John   33      USA    6.7   America
2     1002    Tim   41      USA    3.9   America
3     1003  Jenny   12  Germany    9.0    Europe

## "reset_index" turns "user_id" into a regular column and "set_index" turns the column "name" into the index

In [21]:
df.reset_index().set_index("name")

       user_id  age  country  score continent
name
Mark      1001   55    Italy    4.5    Europe
John      1000   33      USA    6.7   America
Tim       1002   41      USA    3.9   America
Jenny     1003   12  Germany    9.0    Europe

## "reindex" changes the values of index

In [22]:
df.reindex([999, 1000, 1001, 1003])

          name   age  country  score continent
user_id
999        NaN   NaN      NaN    NaN       NaN
1000      John  33.0      USA    6.7   America
1001      Mark  55.0    Italy    4.5    Europe
1003     Jenny  12.0  Germany    9.0    Europe

### sorting index

In [23]:
df.sort_index()

          name  age  country  score continent
user_id
1000      John   33      USA    6.7   America
1001      Mark   55    Italy    4.5    Europe
1002       Tim   41      USA    3.9   America
1003     Jenny   12  Germany    9.0    Europe

In [24]:
# original order of the index
df

          name  age  country  score continent
user_id
1001      Mark   55    Italy    4.5    Europe
1000      John   33      USA    6.7   America
1002       Tim   41      USA    3.9   America
1003     Jenny   12  Germany    9.0    Europe

### sorting rows by multiple columns

In [25]:
df.sort_values(['continent', 'age'])

          name  age  country  score continent
user_id
1000      John   33      USA    6.7   America
1002       Tim   41      USA    3.9   America
1003     Jenny   12  Germany    9.0    Europe
1001      Mark   55    Italy    4.5    Europe

### sorting rows by single column

In [26]:
df.sort_values(['continent'])

          name  age  country  score continent
user_id
1000      John   33      USA    6.7   America
1002       Tim   41      USA    3.9   America
1001      Mark   55    Italy    4.5    Europe
1003     Jenny   12  Germany    9.0    Europe

# Column

In [27]:
# Get the columns of a DataFrame
df.columns

Index(['name', 'age', 'country', 'score', 'continent'], dtype='object')

## Give a name to the set of columns

In [28]:
df.columns.name = 'properties'
df

properties   name  age  country  score continent
user_id
1001         Mark   55    Italy    4.5    Europe
1000         John   33      USA    6.7   America
1002          Tim   41      USA    3.9   America
1003        Jenny   12  Germany    9.0    Europe

### rename columns

In [29]:
df.rename(columns={'name': 'First Name', 'age': 'Age'})

properties First Name  Age  country  score continent
user_id
1001             Mark   55    Italy    4.5    Europe
1000             John   33      USA    6.7   America
1002              Tim   41      USA    3.9   America
1003            Jenny   12  Germany    9.0    Europe

## Delete particular columns and rows

In [30]:
df.drop(columns=['name', 'country'], index=[1000, 1003])

properties  age  score continent
user_id
1001         55    4.5    Europe
1002         41    3.9   America

## Transposition of the DataFrame

In [31]:
df.T

user_id       1001     1000     1002     1003
properties
name          Mark     John      Tim    Jenny
age             55       33       41       12
country      Italy      USA      USA  Germany
score          4.5      6.7      3.9      9.0
continent   Europe  America  America   Europe

In [32]:
df.transpose()

user_id       1001     1000     1002     1003
properties
name          Mark     John      Tim    Jenny
age             55       33       41       12
country      Italy      USA      USA  Germany
score          4.5      6.7      3.9      9.0
continent   Europe  America  America   Europe

## Reorder the columns

In [33]:
df.loc[:, ['continent', 'country', 'name', 'age', 'score']]

properties continent  country   name  age  score
user_id
1001          Europe    Italy   Mark   55    4.5
1000         America      USA   John   33    6.7
1002         America      USA    Tim   41    3.9
1003          Europe  Germany  Jenny   12    9.0

## Selecting data by label
#### df.loc[row_selection, column_selection]

#### slicing in DataFrame selection includes upperbound

In [34]:
df.loc[1001, 'name']

'Mark'

In [35]:
df.loc[[1001, 1002], 'age']

user_id
1001    55
1002    41
Name: age, dtype: int64

In [36]:
df.loc[:1002, ['name', 'country']]

properties  name country
user_id
1001        Mark   Italy
1000        John     USA
1002         Tim     USA

In [37]:
df.loc[:, 'country']

user_id
1001      Italy
1000        USA
1002        USA
1003    Germany
Name: country, dtype: object

In [38]:
df['country']

user_id
1001      Italy
1000        USA
1002        USA
1003    Germany
Name: country, dtype: object

In [39]:
df.loc[:, ['name', 'country']]

properties   name  country
user_id
1001         Mark    Italy
1000         John      USA
1002          Tim      USA
1003        Jenny  Germany

In [40]:
df[['name', 'country']]

properties   name  country
user_id
1001         Mark    Italy
1000         John      USA
1002          Tim      USA
1003        Jenny  Germany

## Selecting data by position
#### df.iloc[row_selection, column_selection]

In [41]:
df.iloc[0, 0]  # Returns a scalar

'Mark'

In [42]:
df.iloc[[0, 2], 1]  # Returns a Series

user_id
1001    55
1002    41
Name: age, dtype: int64

In [43]:
df.iloc[:3, [0, 2]]  # Returns a DataFrame

properties  name country
user_id
1001        Mark   Italy
1000        John     USA
1002         Tim     USA

## Selecting data by boolean indexing

In [44]:
# filter users who is living in the USA and having an age greater than or equal to 40 years old
tf = (df['age'] > 40) & (df['country'] == 'USA')
tf  # a series with only True/False

user_id
1001    False
1000    False
1002     True
1003    False
dtype: bool

In [45]:
df.loc[tf, :]

properties name  age country  score continent
user_id
1002        Tim   41     USA    3.9   America

In [46]:
df.loc[df.index > 1001, :]

properties   name  age  country  score continent
user_id
1002          Tim   41      USA    3.9   America
1003        Jenny   12  Germany    9.0    Europe

In [47]:
df.loc[df['country'].isin(['Italy', 'Germany']), :]

properties   name  age  country  score continent
user_id
1001         Mark   55    Italy    4.5    Europe
1003        Jenny   12  Germany    9.0    Europe

In [48]:
# This could be the yearly rainfall in millimeteres
rainfall = pd.DataFrame(data={'City 1': [300.1, 100.2],
                              'City 2': [400.3, 300.4],
                              'City 3': [1000.5, 1100.6]})

rainfall

   City 1  City 2  City 3
0   300.1   400.3  1000.5
1   100.2   300.4  1100.6

In [49]:
rainfall < 400

   City 1  City 2  City 3
0    True   False   False
1    True    True   False

In [50]:
rainfall[rainfall < 400]

   City 1  City 2  City 3
0   300.1     NaN     NaN
1   100.2   300.4     NaN

## Selecting data by MultiIndex

In [54]:
# A MultiIndex needs to be sorted
df_multi = df.reset_index().set_index(['continent', 'country'])
df_multi = df_multi.sort_index()
df_multi

properties         user_id   name  age  score
continent country
America   USA         1000   John   33    6.7
          USA         1002    Tim   41    3.9
Europe    Germany     1003  Jenny   12    9.0
          Italy       1001   Mark   55    4.5

In [55]:
df_multi.loc['Europe', :]

properties  user_id   name  age  score
country
Germany        1003  Jenny   12    9.0
Italy          1001   Mark   55    4.5

### Use tuple to select multi index

In [56]:
df_multi.loc[('Europe', 'Italy'), :]

properties         user_id  name  age  score
continent country
Europe    Italy       1001  Mark   55    4.5

In [62]:
df_multi

properties         user_id   name  age  score
continent country
America   USA         1000   John   33    6.7
          USA         1002    Tim   41    3.9
Europe    Germany     1003  Jenny   12    9.0
          Italy       1001   Mark   55    4.5

In [61]:
# reset index by the first left column if level is 0 
df_multi.reset_index(level=0)

properties continent  user_id   name  age  score
country
USA          America     1000   John   33    6.7
USA          America     1002    Tim   41    3.9
Germany       Europe     1003  Jenny   12    9.0
Italy         Europe     1001   Mark   55    4.5

In [59]:
df_multi.reset_index(level=1)

properties  country  user_id   name  age  score
continent
America         USA     1000   John   33    6.7
America         USA     1002    Tim   41    3.9
Europe      Germany     1003  Jenny   12    9.0
Europe        Italy     1001   Mark   55    4.5